[{"article_date":1667952000000,"article_title":"NASA's MAVEN Observes Martian Light Show Caused by Major Solar Storm","article_preview":"For the first time in its eight years orbiting Mars, NASA’s MAVEN mission witnessed two different types of ultraviolet aurorae simultaneously, the result of solar storms that began on Aug. 27."},{"article_date":1667260800000,"article_title":"NASA Prepares to Say 'Farewell' to InSight Spacecraft","article_preview":"A closer look at what goes into wrapping up the mission as the spacecraft’s power supply continues to dwindle."},{"article_date":1666915200000,"article_title":"NASA and ESA Agree on Next Steps to Return Mars Samples to Earth","article_preview":"The agency’s Perseverance rover will establish the first sample depot on Mars."},{"article_date":1666828800000,"article_title":"NASA's InSight Lander Detects Stunning Meteoroid Impact on Mars","article_preview":"The agency’s lander felt the ground shake during the impact while cameras aboard the Mars Reconnaissance Orbiter spotted the yawning new crater from space."},{"article_date":1666310400000,"article_title":"NASA To Host Briefing on InSight, Mars Reconnaissance Orbiter Findings","article_preview":"Scientists from two Mars missions will discuss how they combined images and data for a major finding on the Red Planet."},{"article_date":1666224000000,"article_title":"Why NASA Is Trying To Crash Land on Mars","article_preview":"Like a car’s crumple zone, the experimental SHIELD lander is designed to absorb a hard impact."},{"article_date":1666137600000,"article_title":"Curiosity Mars Rover Reaches Long-Awaited Salty Region","article_preview":"After years of climbing, the Mars rover has arrived at a special region believed to have formed as Mars’ climate was drying."},{"article_date":1665532800000,"article_title":"Mars Mission Shields Up for Tests","article_preview":"Protecting Mars Sample Return spacecraft from micrometeorites requires high-caliber work."},{"article_date":1665100800000,"article_title":"NASA's InSight Waits Out Dust Storm","article_preview":"InSight’s team is taking steps to help the solar-powered lander continue operating for as long as possible."},{"article_date":1663545600000,"article_title":"NASA's InSight 'Hears' Its First Meteoroid Impacts on Mars","article_preview":"The Mars lander’s seismometer has picked up vibrations from four separate impacts in the past two years."},{"article_date":1663200000000,"article_title":"NASA's Perseverance Rover Investigates Geologically Rich Mars Terrain","article_preview":"The latest findings provide greater detail on a region of the Red Planet that has a watery past and is yielding promising samples for the NASA-ESA Mars Sample Return campaign."},{"article_date":1662940800000,"article_title":"NASA to Host Briefing on Perseverance Mars Rover Mission Operations","article_preview":"Members of the mission will discuss the rover’s activities as it gathers samples in an ancient river delta."},{"article_date":1661385600000,"article_title":"NASA's Perseverance Makes New Discoveries in Mars' Jezero Crater","article_preview":"The rover found that Jezero Crater’s floor is made up of volcanic rocks that have interacted with water."},{"article_date":1659657600000,"article_title":"10 Years Since Landing, NASA's Curiosity Mars Rover Still Has Drive","article_preview":"Despite signs of wear, the intrepid spacecraft is about to start an exciting new chapter of its mission as it climbs a Martian mountain."},{"article_date":1659571200000,"article_title":"SAM's Top 5 Discoveries Aboard NASA's Curiosity Rover at Mars","article_preview":"“Selfie” of the Curiosity rover with inset showing the SAM instrument prior to installation on the rover."}]